?=значение
------------------------------------------
?.upper() #делает мелкие буквы заглавными.
?.lower() #делает заглавные буквы мелкими.
?.capitalize() #мелкие и заглавние превращает в "Vendetta".
------------------------------------------
?.trim() #удаляет случайные пробелы в начале и конце строки.
?.replace('А' , 'а') #заменяет символ в строке (а). Это на это.
?.split('.') #разбивает строку на список по определенному символу '.'
------------------------------------------
yer = 23
name = 'Dima' 
print('Меня зовут {} и мне {} лет"' .format(name,yer)) #соединение чисел и слов. 
------------------------------------------
password = 'wereg1234'
for symbol in password
print(symbol, symbol.isdigit())
w False
e False
r False                                    #поиск целого числа в строке.
e False
g False
1 True
2 True
3 True
4 True
-------------------------------------------
round(zhto_to,2)                        #отображает 2 знака после запятой