----------------------------------------
a = [1, 6, 8, 5, 2]      #список 
----------------------------------------
a[0]                     #обращение к елементу из списка (отщет начинается с нуля).
>>> 1
----------------------------------------
a[2:4]                   #Срез списка для получения определенного участка списка. 
>>>[8, 5]                #Первый исключительно второй включительно.                          
----------------------------------------
a = [1, 6, 8, 5, 2]
a.append(99)             #добавление елемента в список (конец списка).
 print (a)
 >>>[1, 6, 8, 5, 2, 99]
----------------------------------------
a = [1, 2, 3]
b = [4, 5, 6]
a+b                      #сложение списков воедино. 
>>> [1, 2, 3, 4, 5, 6]
----------------------------------------
roop = [1, 6, 8, 5, 2, 99]
for e in roop:           #в столбец \e\ вывести список \roop\.
    print(e)
>>> 1
    6
    8                    #вывод каждого елемента списка на экран.
    5
    2
    99
----------------------------------------
roop = [1, 2, 3]
reversed(roop)           #возвращает список наоборот.
>>> [3, 2, 1]
----------------------------------------
roop = [3, 1, 4, 2]
sorted(roop)             #сортирует список по алфавиту или от большего к меншему.
>>> [1, 2, 3, 4]
----------------------------------------